Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(100, 28, 28, 1)]   0                                            
__________________________________________________________________________________________________
conv1 (Conv2D)                  (100, 20, 20, 256)   20992       input_3[0][0]                    
__________________________________________________________________________________________________
primary_caps (PrimaryCaps)      (100, 1152, 8)       5308672     conv1[0][0]                      
__________________________________________________________________________________________________
digit_caps (ClassCaps)          (100, 10, 16)        1474560     primary_caps[0][0]               
__________________________________________________________________________________________________
input_4 (InputLayer)            [(None, 10)]         0                                            
__________________________________________________________________________________________________
masked_by_y (Lambda)            (100, 160)           0           digit_caps[0][0]                 
                                                                 input_4[0][0]                    
__________________________________________________________________________________________________
vec_len (Lambda)                (100, 10)            0           digit_caps[0][0]                 
__________________________________________________________________________________________________
decoder (Sequential)            multiple             1411344     masked_by_y[0][0]                
==================================================================================================
Total params: 8,215,568
Trainable params: 8,215,568
Non-trainable params: 0
__________________________________________________________________________________________________
Epoch 1/10
600/600 [==============================] - 248s 413ms/step - loss: 0.6176 - vec_len_loss: 0.5905 - decoder_loss: 0.0691 - vec_len_accuracy: 0.3390 - decoder_accuracy: 0.7993 - val_loss: 0.0674 - val_vec_len_loss: 0.0479 - val_decoder_loss: 0.0499 - val_vec_len_accuracy: 0.9666 - val_decoder_accuracy: 0.7944 - lr: 0.0010
Epoch 2/10
600/600 [==============================] - 252s 419ms/step - loss: 0.0452 - vec_len_loss: 0.0281 - decoder_loss: 0.0436 - vec_len_accuracy: 0.9778 - decoder_accuracy: 0.7973 - val_loss: 0.0345 - val_vec_len_loss: 0.0196 - val_decoder_loss: 0.0380 - val_vec_len_accuracy: 0.9846 - val_decoder_accuracy: 0.8002 - lr: 9.0000e-04
Epoch 3/10
600/600 [==============================] - 254s 423ms/step - loss: 0.0290 - vec_len_loss: 0.0152 - decoder_loss: 0.0351 - vec_len_accuracy: 0.9882 - decoder_accuracy: 0.8013 - val_loss: 0.0260 - val_vec_len_loss: 0.0131 - val_decoder_loss: 0.0330 - val_vec_len_accuracy: 0.9882 - val_decoder_accuracy: 0.8007 - lr: 8.1000e-04
Epoch 4/10
600/600 [==============================] - 267s 444ms/step - loss: 0.0232 - vec_len_loss: 0.0108 - decoder_loss: 0.0316 - vec_len_accuracy: 0.9917 - decoder_accuracy: 0.8031 - val_loss: 0.0235 - val_vec_len_loss: 0.0116 - val_decoder_loss: 0.0303 - val_vec_len_accuracy: 0.9898 - val_decoder_accuracy: 0.8027 - lr: 7.2900e-04
Epoch 5/10
600/600 [==============================] - 244s 407ms/step - loss: 0.0199 - vec_len_loss: 0.0084 - decoder_loss: 0.0293 - vec_len_accuracy: 0.9940 - decoder_accuracy: 0.8044 - val_loss: 0.0197 - val_vec_len_loss: 0.0087 - val_decoder_loss: 0.0281 - val_vec_len_accuracy: 0.9927 - val_decoder_accuracy: 0.8041 - lr: 6.5610e-04
Epoch 6/10
600/600 [==============================] - 239s 399ms/step - loss: 0.0174 - vec_len_loss: 0.0067 - decoder_loss: 0.0273 - vec_len_accuracy: 0.9955 - decoder_accuracy: 0.8055 - val_loss: 0.0182 - val_vec_len_loss: 0.0079 - val_decoder_loss: 0.0264 - val_vec_len_accuracy: 0.9921 - val_decoder_accuracy: 0.8052 - lr: 5.9049e-04
Epoch 7/10
600/600 [==============================] - 252s 419ms/step - loss: 0.0149 - vec_len_loss: 0.0050 - decoder_loss: 0.0252 - vec_len_accuracy: 0.9969 - decoder_accuracy: 0.8067 - val_loss: 0.0173 - val_vec_len_loss: 0.0079 - val_decoder_loss: 0.0240 - val_vec_len_accuracy: 0.9933 - val_decoder_accuracy: 0.8059 - lr: 5.3144e-04
Epoch 8/10
600/600 [==============================] - 271s 451ms/step - loss: 0.0131 - vec_len_loss: 0.0040 - decoder_loss: 0.0232 - vec_len_accuracy: 0.9980 - decoder_accuracy: 0.8077 - val_loss: 0.0165 - val_vec_len_loss: 0.0077 - val_decoder_loss: 0.0223 - val_vec_len_accuracy: 0.9929 - val_decoder_accuracy: 0.8074 - lr: 4.7830e-04
Epoch 9/10
600/600 [==============================] - 256s 426ms/step - loss: 0.0115 - vec_len_loss: 0.0030 - decoder_loss: 0.0217 - vec_len_accuracy: 0.9985 - decoder_accuracy: 0.8086 - val_loss: 0.0157 - val_vec_len_loss: 0.0073 - val_decoder_loss: 0.0214 - val_vec_len_accuracy: 0.9935 - val_decoder_accuracy: 0.8081 - lr: 4.3047e-04
Epoch 10/10
600/600 [==============================] - 249s 414ms/step - loss: 0.0103 - vec_len_loss: 0.0023 - decoder_loss: 0.0204 - vec_len_accuracy: 0.9990 - decoder_accuracy: 0.8093 - val_loss: 0.0145 - val_vec_len_loss: 0.0067 - val_decoder_loss: 0.0199 - val_vec_len_accuracy: 0.9936 - val_decoder_accuracy: 0.8085 - lr: 3.8742e-04