Downloading data from https://storage.googleapis.com/tensorflow/tf-keras-datasets/mnist.npz
11493376/11490434 [==============================] - 0s 0us/step
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(100, 28, 28, 1)]   0                                            
__________________________________________________________________________________________________
conv1 (Conv2D)                  (100, 20, 20, 128)   10496       input_1[0][0]                    
__________________________________________________________________________________________________
primary_caps (PrimaryCaps)      (100, 576, 8)        1327232     conv1[0][0]                      
__________________________________________________________________________________________________
digit_caps (ClassCaps)          (100, 10, 16)        737280      primary_caps[0][0]               
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 10)]         0                                            
__________________________________________________________________________________________________
masked_by_y (Lambda)            (100, 160)           0           digit_caps[0][0]                 
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
vec_len (Lambda)                (100, 10)            0           digit_caps[0][0]                 
__________________________________________________________________________________________________
decoder (Sequential)            multiple             574992      masked_by_y[0][0]                
==================================================================================================
Total params: 2,650,000
Trainable params: 2,650,000
Non-trainable params: 0
__________________________________________________________________________________________________
Epoch 1/10
600/600 [==============================] - 159s 266ms/step - loss: 0.2394 - vec_len_loss: 0.2144 - decoder_loss: 0.0636 - vec_len_accuracy: 0.7702 - decoder_accuracy: 0.7965 - val_loss: 0.0381 - val_vec_len_loss: 0.0199 - val_decoder_loss: 0.0464 - val_vec_len_accuracy: 0.9859 - val_decoder_accuracy: 0.7971 - lr: 0.0010
Epoch 2/10
600/600 [==============================] - 158s 264ms/step - loss: 0.0340 - vec_len_loss: 0.0172 - decoder_loss: 0.0431 - vec_len_accuracy: 0.9872 - decoder_accuracy: 0.7975 - val_loss: 0.0277 - val_vec_len_loss: 0.0121 - val_decoder_loss: 0.0396 - val_vec_len_accuracy: 0.9902 - val_decoder_accuracy: 0.7979 - lr: 9.0000e-04
Epoch 3/10
600/600 [==============================] - 159s 264ms/step - loss: 0.0261 - vec_len_loss: 0.0114 - decoder_loss: 0.0374 - vec_len_accuracy: 0.9918 - decoder_accuracy: 0.8002 - val_loss: 0.0245 - val_vec_len_loss: 0.0108 - val_decoder_loss: 0.0351 - val_vec_len_accuracy: 0.9912 - val_decoder_accuracy: 0.7999 - lr: 8.1000e-04
Epoch 4/10
600/600 [==============================] - 157s 262ms/step - loss: 0.0217 - vec_len_loss: 0.0084 - decoder_loss: 0.0339 - vec_len_accuracy: 0.9940 - decoder_accuracy: 0.8020 - val_loss: 0.0223 - val_vec_len_loss: 0.0095 - val_decoder_loss: 0.0326 - val_vec_len_accuracy: 0.9926 - val_decoder_accuracy: 0.8019 - lr: 7.2900e-04
Epoch 5/10
600/600 [==============================] - 159s 264ms/step - loss: 0.0188 - vec_len_loss: 0.0062 - decoder_loss: 0.0319 - vec_len_accuracy: 0.9959 - decoder_accuracy: 0.8030 - val_loss: 0.0203 - val_vec_len_loss: 0.0081 - val_decoder_loss: 0.0310 - val_vec_len_accuracy: 0.9928 - val_decoder_accuracy: 0.8022 - lr: 6.5610e-04
Epoch 6/10
600/600 [==============================] - 157s 261ms/step - loss: 0.0168 - vec_len_loss: 0.0050 - decoder_loss: 0.0303 - vec_len_accuracy: 0.9970 - decoder_accuracy: 0.8039 - val_loss: 0.0194 - val_vec_len_loss: 0.0078 - val_decoder_loss: 0.0293 - val_vec_len_accuracy: 0.9934 - val_decoder_accuracy: 0.8032 - lr: 5.9049e-04
Epoch 7/10
600/600 [==============================] - 157s 262ms/step - loss: 0.0150 - vec_len_loss: 0.0038 - decoder_loss: 0.0287 - vec_len_accuracy: 0.9975 - decoder_accuracy: 0.8049 - val_loss: 0.0181 - val_vec_len_loss: 0.0073 - val_decoder_loss: 0.0277 - val_vec_len_accuracy: 0.9933 - val_decoder_accuracy: 0.8044 - lr: 5.3144e-04
Epoch 8/10
600/600 [==============================] - 156s 260ms/step - loss: 0.0134 - vec_len_loss: 0.0027 - decoder_loss: 0.0272 - vec_len_accuracy: 0.9987 - decoder_accuracy: 0.8057 - val_loss: 0.0168 - val_vec_len_loss: 0.0064 - val_decoder_loss: 0.0265 - val_vec_len_accuracy: 0.9939 - val_decoder_accuracy: 0.8050 - lr: 4.7830e-04
Epoch 9/10
600/600 [==============================] - 156s 260ms/step - loss: 0.0122 - vec_len_loss: 0.0021 - decoder_loss: 0.0259 - vec_len_accuracy: 0.9990 - decoder_accuracy: 0.8064 - val_loss: 0.0162 - val_vec_len_loss: 0.0064 - val_decoder_loss: 0.0251 - val_vec_len_accuracy: 0.9939 - val_decoder_accuracy: 0.8059 - lr: 4.3047e-04
Epoch 10/10
600/600 [==============================] - 156s 259ms/step - loss: 0.0113 - vec_len_loss: 0.0017 - decoder_loss: 0.0247 - vec_len_accuracy: 0.9993 - decoder_accuracy: 0.8070 - val_loss: 0.0153 - val_vec_len_loss: 0.0059 - val_decoder_loss: 0.0239 - val_vec_len_accuracy: 0.9945 - val_decoder_accuracy: 0.8065 - lr: 3.8742e-04